<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%
    String path = request.getContextPath();
	String basePath = request.getScheme()+"://"+request.getServerName()+":"+request.getServerPort()+path+"/";
%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>生日快乐夫人</title>
<link rel="shortcut icon" type="image/x-icon"
	href="<%=basePath %>/image/icon/icon.ico" media="screen" />
<link rel="stylesheet" href="<%=basePath %>/css/birth.css">
<link rel="stylesheet" href="<%=basePath %>/common/sweetalert/sweetalert.css" />
<script type="text/javascript" src="<%=basePath %>/common/sweetalert/sweetalert-dev.js"></script>
</head>
<body>
<jsp:include page="./loading.jsp"></jsp:include>  
<div id="letter">
	<div class="bd">
	<p id="content">给最爱的夫人：<br/>
&nbsp;&nbsp;&nbsp;&nbsp;午夜已经过去了，格村的街道上开始起雾，最近要下雪了，温度变得接近零度。屋子内暖气很足，我把自己裹在被子里，两只脚也不再冰冷了。<br/>
&nbsp;&nbsp;&nbsp;&nbsp;我又情不自禁地想起你来。自我上一次见夫人已经有两个月之久了，我已经不去想过去了的时间了，只是想还有多久可以见到夫人，不久了还有七个多月，我想和夫人一起去吃饭，想和你一起看电影，想明年我们又到哪一个地方去玩，想抱着你睡觉然后摸着你的头发亲吻着你。这些我几乎每天都会思考，因为想有你之后生活就变得更加容易和轻松了。<br/>
&nbsp;&nbsp;&nbsp;&nbsp;我今天还在想明年到哪儿去呢，陕西？重庆的边界我们都已经走得差不多，只剩下湖北和陕西。但又想着希望给夫人看看更特别的世界，所以我也想带夫人出国去，去泰国住着那种无边游泳池酒店，喝着果汁看着日落的样子，这些都好美好啊。<br/>
&nbsp;&nbsp;&nbsp;&nbsp;那天给夫人说好累，因为家里发生了一些事情，父母闹矛盾闹得很凶，我在左右安慰着他们，因为这个矛盾他们积攒很久，但我不知道如何给夫人谈起，我希望很久之后再告诉夫人。那天还是瓜哥他们给我直播音乐节的时候，夫人告诉我有些感冒然后又去聚会了，然后夫人告诉我说喝了一些酒，我很担心你，又感冒了还要喝酒，这很不好我不希望夫人再喝很多酒了，因为身体原因。那会儿感觉一下所有的事情压在了身上，有些承受不下。但是都已经过去了，至少这些比我暑假去印刷厂打工的那一天好过太多。<br/>
&nbsp;&nbsp;&nbsp;&nbsp;记得当初决定来留学，我很平淡没有犹豫，不是想离开夫人，也不是为了新鲜。我知道这是对我们都好的，为了我们的家，也为了我们的感情，是考验也是互相鼓励的一个经历。但是当我准备离开的那两天，临时决定马上就走，我收拾着东西，一天一天领着快递，给很多亲戚道别，来见夫人的时候感觉到了开始舍不得了。夫人在我离开的那天送我到了成都，走之后告诉我哭得很厉害。走的时候脑子里全是夫人哭着的样子，如那天夫人头疼在厨房蹲坐着的样子一样让人心疼。还是走了，在飞机上，从海关出去的时候，只感觉到身子一下就空了，踏出国门，就只需要睡个觉的时间，我就已经离开了中国的土地。重庆太多的东西都值得我留恋了，太多了太多了，离开这两个多月，心里的滋味只有自己才了解，那种想念和委屈，早就已经全部憋在心中，即使没有人和我针锋相对，他们邀功请赏的样子有些让我感到不适。我依然是感到孤独的，除了和我爱的人在一起的时候。<br/>
&nbsp;&nbsp;&nbsp;&nbsp;终于把网页写完，写这里的时候是11.14日，即使只有一个界面，但动画也做了好些时间。继续说吧夫人，本来我想我们假期去陕西，看看古城墙的样子很好。但现在我有些更盼望去泰国了。我想了想，从这几个月，出国能让人涨更多的见识，也更能考验两个人的处理能力。并且走出国门的那一刻，总会让人感到神奇的，并且我还想让你看到我这一年来的成长，夫人和我一起也许，会有更可靠的感觉了。到这里也许夫人会说还早呢，这些事情总会让我有更好的动力，所以我愿意提及这些。<br/>
&nbsp;&nbsp;&nbsp;&nbsp;我们要更爱对方更理解对方，夫人告诉我是不是不注重你了，当然不是的！我只希望用行动面对，只是有时候行动被时间和空间所限制。我知道有时候夫人在很多人的面前总是以很强大的样子面对，而心中总也还有很多柔弱的一面，我不希望你总是压力很大，但也不希望夫人总会安于现状，劳逸结合但是我会很努力让我们以后有一个很好的将来的。听着现在背景音乐放的这首歌，这是我这几天来很喜欢听的，也是从自己的私人fm里面偶然碰到。读到这里，也许已经是夫人的生日了吧，我不假，很多话也许夫人已经听到腻了，我爱你，我说的话都会是真的。我愿意为夫人做很多的东西，也总是希望以最好的一面来呈现给你，这些都不假，我也不假。不知道为啥，我一直都好想你，也许是和你在一起我真的很安心，我也能感觉到我能够给夫人带来很多可靠的感觉，而这一年的改变我想应该我也变得更好了。人总是要往前走，但是偶尔也要在自己的爱人的面前好好释放，吵架那天和夫人打电话，我没忍住哭得有些说不出声，我也希望夫人能够给我，给我带来很多的关心和安慰，夫人说我们这一群人都是悲观的，但我们更加纯净了，在一起的时候不会去想很多东西，自己做自己想做的，不计较对方怎么样，这就好了。这样的日子我也希望能久一点，人要为了好多东西拼搏呀，当初叫瓜哥和校长他们去看音乐节的时候，我就只给瓜哥说，我希望我们能够找到自己，能够找到那些感觉，为了能让你们像以前一样，也为了我自己不在半路中迷失，还好，瓜哥不沉迷游戏了开始画画起来，校长也和女朋友好好谈恋爱了，二胖买了PS4游戏机可以正在玩呢，但是我知道他的自觉性，我和夫人也在慢慢好好的。其实有些时候，我希望和夫人能够轰轰烈烈不顾什么做些事情，希望我们能够放下学校的事，放下家里的事，放下很多人际交往，然后到一个大草原上一直跑，或者在一个小电动车上，我载着你一直开，毫无保留。我们要乘着现在还没有很大的压力，做一些想起来就开心的事。<br/>
&nbsp;&nbsp;&nbsp;&nbsp;我们一定要好好的，我知道有时候相隔异国，不论是什么都难以有共同的东西，也许时间让我们每天就只几句话了，但是我还是希望能说一句我爱你，希望我们心里都装着对方，一直都会。我也知道有时候夫人看到其他情侣在一起的时候，总会很羡慕和嫉妒，特别是周末或是节日的时候，我也是。但是放心吧我们总有一天会在一起，总有一天可以一起做很多很多事情。我知道我们都还很年轻，也知道我们不一定就决定终身，我一直很爱你，你也爱着我，我们只要有信心就好了。不要去在意别人的看法，也不要去过于听取他们的意见，全盘接受。<br/>
&nbsp;&nbsp;&nbsp;&nbsp;写到现在闭上眼睛全是夫人的样子了，差点忘记今天的主题，是夫人的21岁生日，生日快乐我最爱的夫人。我们已经长大了，也已经是陪伴夫人过的四个生日了，我还对我的20岁生日感到可惜呢！但是夫人好就好了，那天夫人给我说因为这些生气，我觉得做法很好，因为真的有时候不说永远也不知道对方想的是什么。至少，这个做了好多hover的网页，加了框架，做了数据库，也搜索了好几百次这些信息，和写的东西都能证明我很爱你了，我对夫人没有不关心。也只有夫人有这个特殊的账号了，因为其他人登录进去都不会进入这个界面，不信夫人等会儿可以回到登录页用提示的那个帐号密码登录。<br/>
&nbsp;&nbsp;&nbsp;&nbsp;我很想和你在一起住，也很想煮饭给夫人吃。夫人要等我，我也要等你。这是等得到的，是在码头等一艘船，即使是在机场那我也应该是开的飞船。我知道我们要面临的挫折还很多，我们要面临的考验和诱惑也很多，这些都不是打倒我们的压力，我们应该更爱对方，夫人应该更爱我。我也希望夫人能够更加注意自己的身体，我买了一个杯子榨汁机给夫人，小小的很可爱。这些一切的一切都希望你能够过得更好，我爱你夫人。写到这里已经凌晨三点钟，生日快乐小仙女，我坚信我能够陪你过一辈子的生日，我也坚信我们能够把全中国的省份都走个遍，我相信你，相信我们的爱情。努力想我们的未来，过去和现在，我好像有感受到两年之后我们的样子，很幸福。<br/>
&nbsp;&nbsp;&nbsp;&nbsp;午夜已经过去了，格村的街道上开始起雾，最近要下雪了，温度变得接近零度。屋子内暖气很足，我把自己裹在被子里，两只脚没有什么感觉，但是有了你我就不会冷了。生日快乐夫人，我爱你，你一定要嫁给我。<br/>2018年11月16日<br/>
	</p>
	<button id="hide_button" onclick = "hideLetter()">朕已阅</button>
	</div>
</div>
<div class="area">
	<audio id="music" controls loop="loop" muted>
	  		<source src="<%=basePath %>music/Seventeen.mp3" type="audio/mpeg" />
	  		Your browser does not support the audio element.
	</audio>
	<div class="mess" onclick="showLetter()">
		<div><p class="ll"> 予<br/>·<br/> 罗<br/>菱<br/><p class="smFont">2018年11月16日 起</p></p></div>
	</div>
	<div class="info">
		<nav>
			<ul id="index">
				<li class="on"></li>
				<li></li>
				<li></li>
				<li></li>
				<li></li>
				<li></li>
				<li></li>
				<li></li>
				<li></li>
			</ul>
			<ul id="img">
				<li class="opa-on"><img class="image" src="<%=basePath %>image/1.jpg" alt="img1"></li>
				<li><img class="image" src="<%=basePath %>image/2.jpg" alt="img2"></li>
				<li><img class="image" src="<%=basePath %>image/3.jpg" alt="img3"></li>
				<li><img class="image" src="<%=basePath %>image/4.jpg" alt="img4"></li>
				<li><img class="image" src="<%=basePath %>image/5.jpg" alt="img5"></li>
				<li><img class="image" src="<%=basePath %>image/6.jpg" alt="img2"></li>
				<li><img class="image" src="<%=basePath %>image/7.jpg" alt="img3"></li>
				<li><img class="image" src="<%=basePath %>image/8.jpg" alt="img4"></li>
				<li><img class="image" src="<%=basePath %>image/9.jpg" alt="img5"></li>
			</ul>
		</nav>
	</div>
</div>
<script type="text/javascript" src="<%=basePath %>js/birth.js"></script>
</body>
</html>